Revit 2027 API
Workset.IsOpen Property
 Whether the workset is open (rather than closed).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOpen { get; }
Public ReadOnly Property IsOpen As Boolean
	Get
public:
property bool IsOpen {
	bool get ();
}
member IsOpen : bool with get
Property Value
Boolean
Remarks
 The intent of closing a workset is to ask Revit to not display or expand any element in the workset, to reduce memory usage. Note that open/closed status is independent of editability.
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace